/*2/5/ac*/

/*每个区由若干个内存块组成*/

/*每个区由若干个内存块组成，  每个块是4096个字节*/

/*int i = 0;                */

/*    int i = 0;            */

/*     int i = 0;           */

/* int i = 0;               
 *//*
 */

/* int i = 0;
  */int j = 0;              

/*
  每个区由若干个内存块组成，每个块是4096个字节
  每个块的第0个整数指向下个区
  所以是单链表结构
  所以每个区只有4092个字节存放真正的数据                
*/

/* int i = 0;*//*int j = 0;               
 */

/*
 *//*
 */int i =0;                             

/*                                                                                                                                                                                                                               5*/

char p[10] = {'1','2','"'};    /*123*/

/*/char p[10] = {'1','2','"','"'};      123

  char p[10] = {'1','2','"'};*/

char p1[10] = "123//456";     /*123*/

/*   "123/** /456"     */

/*  *char p[10] = "123456";  */

/*/"sffgfghgfgf"   //123